# GetCellStyleOverrideOptions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellStyle..::..GetCellStyleOverrideOptions Method
TableCellStyle Class See Also
---
Gets cell style override options of this cell.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public TableCellStyleOverrideOptions GetCellStyleOverrideOptions()
```

Visual Basic
---
```text
Public Function GetCellStyleOverrideOptions As TableCellStyleOverrideOptions
```

Visual C++
---
```text
public:
TableCellStyleOverrideOptions^ GetCellStyleOverrideOptions()
```

# See Also
TableCellStyle Class
Autodesk.Revit.DB Namespace